//
//  GameModel.swift
//  aliasApp
//
//  Created by Даниил Ермоленко on 22.03.2022.
//

import Foundation

struct GameModel {
    
    var wordIndex = 0
    var score = 0
    
    let gameModel = [
    Model(category: "Легкий", wordsOfCategory: ["метель", "антенна", "дама", "башня", "рация", "зебра", "кредит", "дуб", "документ", "приправа", "боулинг", "алфавит", "свист", "рев", "мат", "правда", "тюлень", "кирпич", "ум", "удача", "стол", "стул", "кровать", "окно", "мышь"]),
    Model(category: "Средний", wordsOfCategory: ["мнение", "жених", "изголовье", "обострение", "грим", "док", "оцепление", "лотерея", "идол", "национальность", "вложение", "симулянт", "поздравление", "каре", "доля", "головоломка", "чародей", "ведьмак", "стихия", "квартирант", "метроном"]),
    Model(category: "Сложный", wordsOfCategory: ["нарцисс", "калач", "батрак", "баллистика", "генералиссимус", "неопровержимость", "манатки", "щеколда", "озорство", "заповедь", "десантирование", "егерь", "эскадрилья", "орден", "постановление", "токарь", "закваска", "прииск", "невозмутимость"]),
    Model(category: "Рулетка", wordsOfCategory: ["метель", "антенна", "дама", "башня", "рация", "зебра", "кредит", "дуб", "документ", "приправа", "боулинг", "алфавит", "свист", "рев", "мат", "правда", "тюлень", "кирпич", "ум", "удача", "стол", "стул", "кровать", "окно", "мышь", "мнение", "жених", "изголовье", "обострение", "грим", "док", "оцепление", "лотерея", "идол", "национальность", "вложение", "симулянт", "поздравление", "каре", "доля", "головоломка", "чародей", "ведьмак", "стихия", "квартирант", "метроном", "нарцисс", "калач", "батрак", "баллистика", "генералиссимус", "неопровержимость", "манатки", "щеколда", "озорство", "заповедь", "десантирование", "егерь", "эскадрилья", "орден", "постановление", "токарь", "закваска", "прииск", "невозмутимость"])
    ]

//    mutating func nextWord() -> String? {
//              wordIndex += 1
//              return easyMode[wordIndex]
//          }
//   
//   
//       mutating func nextWord() {
//           if wordQueue + 1 < easyMode.count {
//               wordQueue += 1
//           } else {
//               wordQueue = 0
//           }
//      }
//   
//       func getWords() -> String {
//           return easyMode[wordIndex]
//       }
//   
//       mutating func getScore() -> Int {
//              return score
//          }
    
    
}
